change = [
    # 0, 1, 2, 3, 4, 5, 6, 7, 8, 9로 반전시킬때 필요한 LED 개수
    [0, 4, 3, 3, 4, 3, 2, 3, 1, 2],
    [4, 0, 5, 3, 2, 5, 6, 1, 5, 4],
    [3, 5, 0, 2, 5, 4, 3, 4, 2, 3],
    [3, 3, 2, 0, 3, 2, 3, 2, 2, 1],
    [4, 2, 5, 3, 0, 3, 4, 3, 3, 2],
    [3, 5, 4, 2, 3, 0, 1, 4, 2, 1],
    [2, 6, 3, 3, 4, 1, 0, 5, 1, 2],
    [3, 1, 4, 2, 3, 4, 5, 0, 4, 3],
    [1, 5, 2, 2, 3, 2, 1, 4, 0, 1],
    [2, 4, 3, 1, 2, 1, 2, 3, 1, 0]
]

n, k, p, x = map(int, input().split())
x = str(x)
x = x.zfill(k)

ans = 0
# 1부터 n까지 수를 x에서 p개 이하로 반전시켜 만들 수 있는 지 확인
for i in range(1, n + 1):
    cnt = 0
    s = str(i).zfill(k)
    for j in range(k):
        cnt += change[int(x[j])][int(s[j])]
        if cnt > p: continue
    if cnt > 0 and cnt <= p:
        ans += 1
print(ans)
